[{"SCENE_NUM":0,"scene":0,"flashback":false,"intensity":-0.000963,"content_short":"_BEGINNING_\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n By"},{"SCENE_NUM":1,"scene":1,"flashback":false,"intensity":-0.000963,"content_short":"EXT. SUBURBAN NEIGHBORHOOD - DAWN\n On a quiet street, a cookie-cutter starter home blends in with all the others. The curtains are drawn, the lights off. Crickets chirp, but otherwise there’s silence. A few cars line the street, dew covering windshields as dawn approaches.\n As we PUSH FOWARD, timed sp"},{"SCENE_NUM":2,"scene":2,"flashback":false,"intensity":0.55047274,"content_short":"INT. FRONT ROOM - SUBURBAN HOME - DAWN\n The place is bare except for gauzy curtains over the windows. Wires cross the well-trod carpet, running in all directions to laptops and Panasonic Toughbooks on foldout tables. This is an FBI safe house.\n And how did these men get into business together?\n At a fo"},{"SCENE_NUM":3,"scene":3,"flashback":false,"intensity":-0.000963,"content_short":"EXT. SUBURBAN HOME - DAWN\n The crickets are still chirping; the timed sprinklers still running, finally retracting into the soggy lawn.\n Through the CRACKED WINDSHIELD of an UNMARKED CAR, STEAM escapes like a ghost into the cold dawn air --\n -- as TWO AGENTS sit dead inside, killed by head shots.\n A dis"},{"SCENE_NUM":4,"scene":4,"flashback":false,"intensity":0.46475178,"content_short":"INT. TOP OF STAIRS - SUBURBAN HOME - DAWN\n Cruise moves up the stairs, in front of The Mother, in silence. A FOURTH AGENT is now upstairs, moving toward a window lit with pale dawn light when --\n -- the shot flies straight through him. Cruise’s instincts kick in and he rushes for the fallen man:\n Not t"},{"SCENE_NUM":5,"scene":5,"flashback":false,"intensity":0.7297468,"content_short":"INT. BOTTOM OF STAIRS - SUBURBAN HOME - DAWN\n She unsnaps CRUISE’S SIDEARM from his holster. Weakly, he fights for it, protesting.\n Shhh.\n She checks the clip: ONE ROUND LEFT. As she slides it back in, she meets his terrified eyes."},{"SCENE_NUM":6,"scene":6,"flashback":false,"intensity":0.5251259,"content_short":"INT. KITCHEN - SUBURBAN HOME - DAWN\n The Mother drags Cruise across the tile floor, leaving a trail of blood.\n She rids herself of her coat and hoodie, increasing her mobility as she ransacks drawers to find: SUPER GLUE.\n TINFOIL. A CANDLE.\n She tears Cruise's shirt open. She rinses his wound as his eye"},{"SCENE_NUM":7,"scene":7,"flashback":false,"intensity":0.6455162,"content_short":"INT. BATHROOM - SUBURBAN HOME - DAWN\n Reflected in a crossfire of angled MIRRORS, The Mother empties a SHAMPOO BOTTLE.\n She fills it with DRANO from under the sink.\n Next, she adds WATER and a twist of TINFOIL.\n She breaks the CANDLE in half. Sticks it in the top of the shampoo bottle. She lights it..."},{"SCENE_NUM":8,"scene":8,"flashback":false,"intensity":0.6127304,"content_short":"INT. MATERNITY WARD - HOSPITAL - NIGHT\n A TRANSLUCENT SHEET separates The Mother’s face from the EMERGENCY C-SECTION and SURGERY TO A STAB WOUND.\n Instruments are counted. Sedative is injected into an IV.\n A mask is lowered to her face.\n A nurse steps behind the sheet to meet her eyes.\n You’re doing grea"},{"SCENE_NUM":9,"scene":9,"flashback":false,"intensity":0.22836238,"content_short":"INT. CORRIDOR - HOSPITAL - NIGHT\n RISE UP to reveal The Mother, rolling her IV down the corridor late at night. She heads to the empty circular desk. At a coffee station beyond, she notes an FBI GUARD getting coffee with the NIGHT NURSE, oblivious."},{"SCENE_NUM":10,"scene":10,"flashback":false,"intensity":0.6166257,"content_short":"INT. ICU RECOVERY ROOM - HOSPITAL - MOMENTS LATER\n The Mother slips into the room. An FBI AGENT, keeping vigil, rises from his chair to remove her. Cruise stops him with a shake of the head. The FBI Agent steps out of the room.\n His chest is sutured, a tube running from the base of his lung. His eyes"},{"SCENE_NUM":11,"scene":11,"flashback":false,"intensity":0.59888184,"content_short":"INT. NEONATAL CARE UNIT - HOSPITAL - NIGHT\n The Mother faces the nursery filled with BABIES in basinets. She focuses, willing safety into the little girl in the middle, surrounded by other underweight and low APGAR score babies, one of which is crying shrilly.\n There’s a NEW FATHER watching his own ba"},{"SCENE_NUM":12,"scene":12,"flashback":false,"intensity":0.2132881,"content_short":"EXT. FERRY - ALASKAN BAY - EARLY MORNING\n The WIND WHISTLES across the cold bay.\n On the stern of a ferry, The Mother is bundled in a winter coat and wool hat. She peers out at the desolate forest, eyes assessing every risk.\n There’s nothing here beyond a battered dock, one little market, endless trees"},{"SCENE_NUM":13,"scene":13,"flashback":false,"intensity":-0.000963,"content_short":"INT. MARKET - AT THE DOCK - EARLY MORNING\n JONS (late 50s) is the SHOP OWNER. Rough hands, rougher personality. He turns on the lights and opens the door."},{"SCENE_NUM":14,"scene":14,"flashback":false,"intensity":0.17594033,"content_short":"EXT. MARKET - AT THE DOCK - EARLY MORNING\n Jons nods to the FERRYMEN unloading the boat at the dock, then notices THE MOTHER stepping out of the shadows.\n Don’t sneak up on somebody with PTSD.\n They look at each other for a long moment.\n Well now I’m really fucking triggered.\n He turns and locks the stor"},{"SCENE_NUM":15,"scene":15,"flashback":false,"intensity":-0.000963,"content_short":"INT./EXT. JONS’S TRUCK - ALASKAN WILDERNESS - DAY\n The Mother is in the passenger seat. Jons drives. There’s nothing but wilderness as far as the eye can see.\n You’ll need a job. Some of the ranchers will pay good money for shooters like you. Get rid of the wolves.\n I don’t want to shoot wolves.\n You fo"},{"SCENE_NUM":16,"scene":16,"flashback":false,"intensity":0.23044078,"content_short":"EXT. ALASKAN CABIN - DAY\n Jons pulls up to a cabin in the middle of nowhere. Her eyes dart, looking for places where trouble could hide."},{"SCENE_NUM":17,"scene":17,"flashback":false,"intensity":0.43934995,"content_short":"INT./EXT. ALASKAN CABIN - DAY\n Dust, mildew -- it’s no castle. In fact, the cabin is rotting back into the earth.\n It’s perfect.\n He turns to leave, then pauses.\n You want me to I could--\n I don’t want anything, Jons.\n She feels it was too fast, too harsh. He reloads, choosing his words carefully.\n Hey. We"},{"SCENE_NUM":18,"scene":18,"flashback":false,"intensity":0.5636611,"content_short":"INT./EXT. SNIPER’S NEST - ALASKAN FOREST - DAY\n VERTIGO. Twenty-five feet up TWO BLACK COTTONWOOD TREES, the Mother lies in a SNIPER'S NEST. One eye is closed, the other stares through the scope of a SNIPER RIFLE. She breathes steadily, waiting...\n THROUGH THE SCOPE: A YOUNG CARIBOU saunters into the"},{"SCENE_NUM":19,"scene":19,"flashback":true,"intensity":0.2307908,"content_short":"EXT. RED SAND DESERT, UZBEKITSTAN - DAY - 2005 -FLASHBACK\n -- She’s in US Marine desert camos. Sand blows into her face as she lines up a shot. She TAPS two fingers onto her collarbone, seeming to regain focus. On the THIRD TAP --"},{"SCENE_NUM":20,"scene":20,"flashback":false,"intensity":0.20312062,"content_short":"INT./EXT. SNIPER’S NEST - ALASKAN FOREST - DAY - PRESENT\n -- She’s focused on the CARIBOU again, as the canopy of trees rocks and creaks in the wind. She taps her collarbone and on the third tap, we’re in:"},{"SCENE_NUM":21,"scene":21,"flashback":true,"intensity":0.7952314,"content_short":"EXT. RED SAND DESERT, UZBEKISTAN - DAY - 2005 - FLASHBACK\n -- In a Sniper “Stress Test,” The Mother crawls low under barbed wire.\n -- She runs in place, knees high. As sweat beads on her, we hone in on a PULSE OXIMETER on her wrist. Her digital pulse is rising, 121, 122, 123.\n I want those hearts on fi"},{"SCENE_NUM":22,"scene":22,"flashback":false,"intensity":0.25546944,"content_short":"INT./EXT. SNIPER’S NEST - ALASKAN FOREST - DAY\n THE SUN flares through the high wavering trees. The Mother’s finger SQUEEZES the trigger at the caribou.\n BOOM!\n She doesn't even wait to see the animal go down. She knows she hit her target."},{"SCENE_NUM":23,"scene":23,"flashback":false,"intensity":0.00212336,"content_short":"EXT. ALASKAN FOREST - DAY\n The Mother treks, hunting rifle slung over her shoulder..."},{"SCENE_NUM":24,"scene":24,"flashback":false,"intensity":0.6257728,"content_short":"EXT. WOLF DEN - ALASKAN RIVER - DAY\n The Mother emerges from the tree line and freezes.\n Near the river, a SHE-WOLF tears at the CARIBOU CARCASS.\n Her WOLF CUBS yip at the MOUTH OF THE DEN nearby, about twelve-weeks old, babies.\n The Mother pulls her rifle and chambers a round: KA-CHHK!\n The She-wolf's a"},{"SCENE_NUM":25,"scene":25,"flashback":false,"intensity":0.18637633,"content_short":"EXT. ALASKAN CABIN - DAY\n The Mother drags the caribou carcass behind her on a sled.\n Through the trees, a TRUCK’S TIRES crunch on snow and ice. She whips out her gun, lines the barrel up with the driver:\n JONS, braking hard, hands up. The years have not been kind to him."},{"SCENE_NUM":26,"scene":26,"flashback":false,"intensity":0.26652068,"content_short":"INT. ALASKAN CABIN - DAY\n Jons has a permanent limp, an old injury degenerating.\n She tosses her gun on the table. Her place is now covered wall-to-wall with books. Some lay out on tables -- deep dives into language courses, botany, survivalism.\n Jons says nothing, but pulls an envelope from his pocket"},{"SCENE_NUM":27,"scene":27,"flashback":false,"intensity":0.16638906,"content_short":"INT. ALASKAN CABIN - DAY\n BREAD. JERKY. DRAMAMINE. FLASHLIGHT. BLANKET. CASH.\n BURNER PHONE. 9MM PISTOL. ZIPPO; a relic. Russian. It’s all laid out to pack with OCD precision.\n Then she stuffs everything into a duffel and pulls a BLACK CASE from underneath her bed."},{"SCENE_NUM":28,"scene":28,"flashback":false,"intensity":0.26085132,"content_short":"INT. MARKET - AT THE DOCK - LATE AFTERNOON\n The Mother picks a strange assortment of items off the shelves: WATER, PROTEIN BARS, BATTERIES, KITTY LITTER, ZIPLOCK BAGS, DUCT TAPE, TOWELS. There’s another SHOPPER in the store. She heads to Jons for him to ring it up.\n Find everything you need?\n She nods,"},{"SCENE_NUM":29,"scene":29,"flashback":false,"intensity":-0.000963,"content_short":"EXT. CINCINNATI AIRPORT - HEBRON, KY - DAWN\n A FedEx plane sits on the tarmac, belly open, engines cooling down. CARGO CONTAINERS descend down a conveyer belt onto a cart. Amid the chain --\n -- #457831 is stenciled on a cargo container."},{"SCENE_NUM":30,"scene":30,"flashback":false,"intensity":0.24019621,"content_short":"INT. HANGER - CINCINNATI AIRPORT - DAWN\n A FEDEX WORKER unlocks the container and steps back as --\n -- THE MOTHER climbs out, squinting at the hot light.\n Across the tarmac she sees an UNMARKED SUV approaching, her reflection rising up in its tinted windows.\n A window rolls down onto a man in a suit. Sh"},{"SCENE_NUM":31,"scene":31,"flashback":false,"intensity":0.26265424,"content_short":"INT. CRUISE’S SUV - CONTINUOUS\n The Mother climbs into the shotgun seat and slams the door. Cruise pauses a moment to slip cash to the FEDEX WORKER out the window, then drives off the tarmac.\n She’s in trouble?\n Are we going to say hello first?\n Hello.\n Civilization is built on the little things.\n Tell me"},{"SCENE_NUM":32,"scene":32,"flashback":false,"intensity":0.4242388,"content_short":"EXT. MILFORD MIDDLE SCHOOL - AFTERNOON\n The sound of children playing is omnipresent, high-pitched and exuberant. The Mother stays far back, watching.\n From behind parked cars, The Mother sees kids leave school, dragging sweatshirts, wiping noses, spilling backpacks. It’s a mess of horseplay and pre-t"},{"SCENE_NUM":33,"scene":33,"flashback":false,"intensity":0.246473,"content_short":"EXT. ZOE'S HOUSE - MILFORD, OH - NIGHT\n The Mother watches the house from across the street, lights coming on between rooms, a BIG SCREEN TV playing in the front window. It’s just any modest, suburban home.\n But The Mother watches, rapt, as shadows move between rooms. She glimpses Zoe on her iPHONE, c"},{"SCENE_NUM":34,"scene":34,"flashback":false,"intensity":-0.000963,"content_short":"EXT. PARK - A DIFFERENT DAY\n A bunch of balloons are tied to a park bench. One slips free, flying toward a parking structure.\n INTERCUT WITH"},{"SCENE_NUM":35,"scene":35,"flashback":false,"intensity":0.82821256,"content_short":"INT./EXT. PARKING GARAGE (2ND LEVEL) - DAY\n The loose balloon floats past the adjacent PARKING GARAGE, where The Mother watches THROUGH A SCOPE.\n It’s the BIRTHDAY PARTY of some much younger family friend. Party food on picnic tables, gifts piling up.\n Dads in khakis abound.\n THROUGH THE SCOPE the Mothe"},{"SCENE_NUM":36,"scene":36,"flashback":false,"intensity":-0.000963,"content_short":"INT. PARKING GARAGE - DAY\n ON THE VAN: The squealing tires rise as the van searches floor to floor."},{"SCENE_NUM":37,"scene":37,"flashback":false,"intensity":0.5566943,"content_short":"INT. PARKING GARAGE (2ND LEVEL) - DAY\n ON THE MOTHER: She slides down under a vehicle, on her back and moves beneath the undercarriage, staying low, out of sight.\n SHE HEARS A SHOT, A LOUD RECOIL. Across the vast pavement, she sees the GUNMAN’S SPENT SHELL CASING hit the ground and roll downhill.\n It k"},{"SCENE_NUM":38,"scene":38,"flashback":false,"intensity":-0.000963,"content_short":"INT. UNDERNEATH CARS - PARKING GARAGE - DAY\n ON THE MOTHER, faster, she worms her way ahead, glass raining... until she comes to the RUSTED UNDERCARRIAGE OF--- AN ANCIENT PICKUP. A massive COLLECTION OF RECYCLING in the back bed."},{"SCENE_NUM":39,"scene":39,"flashback":false,"intensity":0.5349831,"content_short":"INT. PARKING GARAGE (2ND LEVEL) - DAY\n The gunshots cease as the GUNMAN pauses, dropping a clip and reloading. He sees the ANCIENT OLD PICKUP, looking past it as we --\n SINK DOWN TO --\n -- THE MOTHER pulls off the last RUSTED METAL below the front cab, silent, holding it as she --"},{"SCENE_NUM":40,"scene":40,"flashback":false,"intensity":0.5529373,"content_short":"INT./EXT. ANCIENT OLD PICK-UP - PARKING GARAGE - DAY\n -- SHIMMIES UP through a gutted hole into the TRUCK.\n THE GUNMAN doubles over, glancing under cars, pacing as --\n THE MOTHER keeps low, rifling through trash and tools littered around the truck. She pulls a KNIFE from her ankle holster.\n The GUNMAN b"},{"SCENE_NUM":41,"scene":41,"flashback":false,"intensity":0.26810795,"content_short":"EXT. ALLEY - BELOW PARKING GARAGE - CONTINUOUS\n -- LEAPING OFF THE SIDE, onto a parked truck, and tumbling to the ground.\n She weathers the brutal fall, then looks up as an UNMARKED CAR reverses up beside her.\n She hears its doors unlock."},{"SCENE_NUM":42,"scene":42,"flashback":false,"intensity":0.6429582,"content_short":"INT. CRUISE’S SUV - UNMARKED - ALLEY/DRIVING - CONTINUOUS\n She drops into the BACK SEAT behind Cruise. She’s covered with glass, grease, gunpowder burns, the blood of little cuts and splinters.\n Christ. You okay?\n Go, drive.\n He accelerates, putting some distance between them.\n You recognize that guy who"},{"SCENE_NUM":43,"scene":43,"flashback":false,"intensity":0.13150567,"content_short":"EXT. ZOE'S HOUSE/CRUISE’S CAR - NIGHT\n Dressed like a Fed in her clean clothes, The Mother sits in the back seat with the door open, eyeing the house full of bright windows.\n Exhausted, she puts her head back to rest for a moment.\n Crickets scrape; a highway moans in the distance. A dog barks incessant"},{"SCENE_NUM":44,"scene":44,"flashback":true,"intensity":0.04783759,"content_short":"EXT. BLACK MARKET - AFGHANISTAN-AFTERNOON 2006 -FLASHBACK\n -- A DOG chained up by a bazaar stall, barking as she passes. Near Baghram’s NATO airbase, a sprawling BLACK MARKET has formed, selling pilfered US and Coalition supplies.\n THE MOTHER and ADRIAN walk through in uniform, causing a stir amid the"},{"SCENE_NUM":45,"scene":45,"flashback":false,"intensity":0.455258,"content_short":"INT. PRIVATE STALL - BLACK MARKET - CONTINUOUS\n Adrian moves into the dark space. The Mother follows, aware of the danger. The Guards look on. The Mother notes their barely concealed WEAPONS.\n I could get in trouble for being here with you.\n You could also make real money. You have a pristine eye --\n So"},{"SCENE_NUM":46,"scene":46,"flashback":false,"intensity":-0.000963,"content_short":"EXT. SHACK/BASE - AFGHANISTAN - SUNSET\n As a SAS JEEP pulls up outside the base, The Mother steps out. Adrian drives away in a cloud of dust."},{"SCENE_NUM":47,"scene":47,"flashback":false,"intensity":0.17017378,"content_short":"INT. SHACK/BASE - AFGHANISTAN - SUNSET\n In a cinderblock shack, A YOUNGER JONS washes cups in a bucket. His eyes follow her from Adrian’s vehicle.\n She sits at a cot by a fluorescent lamp and goes through her pack, pulling out PHRASEBOOKS for Dari and Pashto.\n Below them, she finds a pouch of rolling t"},{"SCENE_NUM":48,"scene":48,"flashback":false,"intensity":0.5417956,"content_short":"EXT. ZOE’S HOUSE/CRUISE’S CAR - NIGHT - THE PRESENT\n -- The Mother’s eyes open, facing the wavering light from the TV through the front window.\n She realizes Zoe’s adoptive mother, SONYA, has been watching her. She’s at the window, wearing a sling. They meet eyes, something charged passing between the"},{"SCENE_NUM":49,"scene":49,"flashback":false,"intensity":0.32636285,"content_short":"INT. ZOE'S HOUSE - CONTINUOUS\n -- past the ENTRY HALL and SIX FEDS. In the lounge room Cruise sits with Zoe’s parents. They’re in shock, sickened by the abduction of their child. Cruise is a comforting presence, a trusted friend.\n Bathroom.\n A FED whispers into his transmitter coil necklace.\n She’s usin"},{"SCENE_NUM":50,"scene":50,"flashback":false,"intensity":0.01338546,"content_short":"INT. ZOE’S BEDROOM - CONTINUOUS\n ZOE’S ROOM. It a massive collage, a language The Mother doesn’t speak: posters of a few “old school” emo bands stand out amid YouTubers like SSSniperWolf and other Twitch gamers. Trophies line the messy tops of dressers amid a visual history of pre-teen crushes and ca"},{"SCENE_NUM":51,"scene":51,"flashback":false,"intensity":0.14338401,"content_short":"EXT. ZOE'S HOUSE - NIGHT\n The Mother finds CRUISE waiting by the SUV, a MANILA ENVELOPE in his hand. He pulls out two passports.\n Any guesses where we’re going?\n Hector can’t be anywhere but Cuba now. He steps one foot off, he gets arrested, killed or both.\n She opens the passports: a woman that looks v"},{"SCENE_NUM":52,"scene":52,"flashback":true,"intensity":0.17638448,"content_short":"EXT. GUANTANAMO BAY - DAY - 2007 - FLASHBACK\n The blue of the ocean. Pristine white sand. A perfect place for a honeymoon until--\n We pull back to reveal THE MOTHER, torpid in the heat and humidity, manning a SNIPER TOWER outside the BARBED WIRE around the military prison. The years on this tour have"},{"SCENE_NUM":53,"scene":53,"flashback":false,"intensity":0.66768587,"content_short":"EXT. VISTA NEAR BASE - GUANTANAMO - DAY\n The Mother stops near Hector, who sits smoking on a metal chair, facing the vast blue ocean through layers of razor wire.\n Oye, Look who came down out of the clouds. You want a smoke?\n No, thanks.\n No, no, good. Stay pure.\n He eyes her up and down, inhaling his ci"},{"SCENE_NUM":54,"scene":54,"flashback":false,"intensity":-0.000963,"content_short":"EXT. PLANE/SKY - DAY - PRESENT DAY\n A small charter plane flies above the ocean."},{"SCENE_NUM":55,"scene":55,"flashback":false,"intensity":0.40311545,"content_short":"INT. PLANE - FLYING - CONTINUOUS\n Inside the plane, the Mother dozes. She startles awake to find Cruise watching her.\n You okay?\n Aggravated and unsettled by his watching her, she turns away."},{"SCENE_NUM":56,"scene":56,"flashback":false,"intensity":-0.000963,"content_short":"EXT. PLANE/HAVANA AIRPORT RUNWAY - DAY\n The Mother and Cruise disembark in the bright Cuban sunshine."},{"SCENE_NUM":57,"scene":57,"flashback":false,"intensity":0.24333619,"content_short":"EXT. RAFAEL TREJO BOXING GYM - CUBA - DAY - THE PRESENT\n CLOSE ON A TARÁNTULA TATTOO -- ON THE BACK OF A NECK. The spider image guides us though a thick, jostling crowd, as this man greets people and takes bets.\n Tucked in tight between crumbling apartment buildings, this is Cuba’s famous ring. TWO BO"},{"SCENE_NUM":58,"scene":58,"flashback":false,"intensity":-0.000963,"content_short":"EXT. CUBAN BAR - DAY\n A corner bar in a busy Havana neighborhood. The Mother slips inside and heads for the bar."},{"SCENE_NUM":59,"scene":59,"flashback":false,"intensity":0.24208859,"content_short":"INT. CUBAN BAR - CONTINUOUS\n The Mother approaches the bar, watching in a cracked mirror as TARANTULA moves through the bar, well-known and feared in the neighborhood.\n The Mother makes brief eye contact with Cruise, positioned deeper in the room. Cruise follows Tarantula into a back corridor.\n The Mot"},{"SCENE_NUM":60,"scene":60,"flashback":false,"intensity":0.6376331,"content_short":"INT./EXT. CUBAN BAR/STOREROOM - MOMENTS LATER\n As TARÁNTULA emerges through a doorway, drawing his gun from his waistband --\n -- OOF! He’s struck in the gut by something: The Mother, already in the storeroom to intercept him. As TARÁNTULA whips his gun ahead at her and hears --\n -- THE HAMMER PULLED BA"},{"SCENE_NUM":61,"scene":61,"flashback":false,"intensity":0.10998345,"content_short":"EXT. STREET/CUBAN BAR STOREROOM - CONTINUOUS\n The sound of gunfire echos from the store room behind them\n Tarantula cuts in front of a car. The Mother gives chase.\n A second car screeches to a halt. She jumps over the hood.\n A LOCAL WOMAN carrying groceries, is grabbed by Tarantula who throws her into t"},{"SCENE_NUM":62,"scene":62,"flashback":false,"intensity":0.6598772,"content_short":"EXT. STREETS - CUBA - DAY\n NUNS emerge from a local church as Tarantula rounds the corner, charging through them, causing one to fall as the Mother appears. The Mother takes a moment to help the Nun to her feet, never taking her eyes off Tarantula.\n Tarantula uses the diversion to gain ground, AVOIDIN"},{"SCENE_NUM":63,"scene":63,"flashback":false,"intensity":0.1126677,"content_short":"INT. HAVANA APARTMENT - CONTINUOUS\n A group of OLD CUBAN GUYS play dominos in an internal courtyard. Steam and smoke fill the air from pots cooking on a gas ring. An OLD LADY watches the chaos unfold as TARANTULA descends the internal stairs at speed. The Mother VAULTS THE BANNISTER, tackling Tarantu"},{"SCENE_NUM":64,"scene":64,"flashback":false,"intensity":0.351512,"content_short":"EXT. BACKYARD/HAVANA NEIGHBORHOOD - CONTINUOUS\n -- A SMALL YARD, where the Mother sees Tarantula slip through layers of laundry drying. He glances over his shoulder to see her pursuing, and THROWS an OLD MOTORCYCLE in her path as he--\n KICKS through a WOODEN DOOR in a backyard FENCE and disappears.\n Th"},{"SCENE_NUM":65,"scene":65,"flashback":false,"intensity":0.27929986,"content_short":"EXT. CUBAN STREET - DAY\n Cruise runs hard.\n ON THE MOTORCYCLE\n Revving the throttle, the Mother launches down the pathway after him, moving toward stairs.\n REVEAL: A GROUP OF SCHOOLKIDS approaching the stairs from the level below, hidden from her view.\n As she thumps down the stairs, rounding the bend --"},{"SCENE_NUM":66,"scene":66,"flashback":false,"intensity":0.3573895,"content_short":"EXT. HAVANA INTERSECTION - CONTINUOUS\n Heading towards a four-lane intersection, the Mother rejoins the pursuit on the bike. Up ahead, Cruise gains on Tarántula. The Mother accelerates.\n She sees Tarántula run straight through the BUSY INTERSECTION, narrowly dodging traffic, horns blaring.\n The Mother"},{"SCENE_NUM":67,"scene":67,"flashback":false,"intensity":0.3478565,"content_short":"EXT. HAVANA INTERSECTION - CONTINUOUS\n The Mother pulls herself to her feet, unbuckling the helmet as THE CAB DRIVER, gesticulates:\n ¡Estúpida hija de puta!\n She heads straight for him as she removes the helmet, ignores his enraged, spitting tirade. Helmet off, she SMACKS HIM IN THE FACE with it. As th"},{"SCENE_NUM":68,"scene":68,"flashback":false,"intensity":0.16428517,"content_short":"EXT. MALACON/PARALLEL ALLEY - MOMENTS LATER\n As Cruise gains on an exhausted Tarántula --\n THE MALECÓN\n -- THE MOTHER races the CAB down the MALECÓN, running parallel. HIGH TIDE splashes against the stone barrier and throws water up like a fountain along her side.\n She can see Cruise and Tarántula on a"},{"SCENE_NUM":69,"scene":69,"flashback":false,"intensity":0.40314847,"content_short":"EXT. HAVANA STREET TO CHURCH SQUARE - CONTINUOUS\n Tarántula looks back to see Cruise gaining on him. He sprints toward a church and a crowd in the distance.\n CLOSER -- A WEDDING PARTY has just emerged and the BRIDE stands on the CHURCH STEPS, preparing to throw her BOUQUET over her shoulder.\n The MOTHE"},{"SCENE_NUM":70,"scene":70,"flashback":false,"intensity":0.63751274,"content_short":"INT. ABANDONED BATHS - EMPTY POOL - LATE AFTERNOON\n In an abandoned swimming pool draped with overgrown vines, TARÁNTULA is tied to a broken chair. Cruise looks on as The Mother interrogates him in Spanish, with subtitles.\n I don’t know about this.\n Hector’s at the plantation, yes? Then what about the"},{"SCENE_NUM":71,"scene":71,"flashback":false,"intensity":0.7275858,"content_short":"INT. ROOM - HOTEL - NIGHT\n WEAPONS & TACTICAL GEAR cover the bed. The Mother in a robe, post-shower, loads an MR-15, then straps the knife rig to her forearm.\n Cruise sits, shirtless as he cleans out his scrapes with Wet Wipes. A HEAVY SILENCE hangs...\n He twists to study the wound in a mirror. The Mot"},{"SCENE_NUM":72,"scene":72,"flashback":false,"intensity":-0.000963,"content_short":"EXT. STREET - CUBAN ISLAND - NIGHT\n An empty street. A black LADA slows just enough for... The Mother to hop out, duffel slung over her shoulder, and disappear into the darkness..."},{"SCENE_NUM":73,"scene":73,"flashback":false,"intensity":0.2994241,"content_short":"EXT. ABANDONED LOT - CUBAN ISLAND - MOMENTS LATER\n The Mother assembles her HK416 Rifle; suppressor, scope, mag. Then positions the rifle through the balcony's rail.\n In position.\n The RADIO in her ear BUZZES --\n Copy.\n THROUGH THE SCOPE:\n Engulfed in foliage, The Plantation sits below her. It’s not simpl"},{"SCENE_NUM":74,"scene":74,"flashback":false,"intensity":0.00456385,"content_short":"EXT. HECTOR’S VILLA GROUNDS - CONTINUOUS\n Cruise watches them fall. He moves closer to the mansion."},{"SCENE_NUM":75,"scene":75,"flashback":false,"intensity":-0.000963,"content_short":"EXT. ABANDONED LOT/CUBAN ISLAND - MOMENTS LATER\n The Mother breathes slowly, as the scope sweeps the building, past a STAIRWELL TOWER. A GUARDS’S FIGURE (#5) can be seen crossing the stained glass window."},{"SCENE_NUM":76,"scene":76,"flashback":false,"intensity":0.23027788,"content_short":"INT. ENTRY STAIRS - HECTOR’S VILLA - CONTINUOUS\n Inside, GUARD #5 descends the stairs beside the STAINED GLASS WINDOW.\n Suddenly, a bullet pierces the stained glass panel. A beam of untouched LIGHT shines straight through a panel.\n THE GUARD drops onto the marble, shot in the head --\n -- his blood leaks"},{"SCENE_NUM":77,"scene":77,"flashback":false,"intensity":-0.000963,"content_short":"EXT. FRONT TERRACE - HECTOR’S VILLA - NIGHT\n TWO GUARDS (#6 + #7) smoke on the front terrace, oblivious. They are both killed silently and efficiently."},{"SCENE_NUM":78,"scene":78,"flashback":false,"intensity":-0.000963,"content_short":"EXT. ENTRANCE - HECTOR’S VILLA - NIGHT\n Cruise, hidden, lowers his gun.\n Access clear."},{"SCENE_NUM":79,"scene":79,"flashback":false,"intensity":-0.000963,"content_short":"EXT. GARDENS/POOL - HECTOR’S VILLA - NIGHT\n The Mother moves swiftly through the dense gardens encircling the villa. She passes --\n -- a SWIMMING POOL. Pop! Through a silencer she downs another GUARD #8, dropping him into the water."},{"SCENE_NUM":80,"scene":80,"flashback":false,"intensity":0.000321,"content_short":"INT. STAIRCASE - HECTOR’S VILLA - NIGHT\n A NEW GUARD #9 heads down the staircase. He finds the dead guard and steps over him, heading toward the front doors. He pushes them open and steps out into --"},{"SCENE_NUM":81,"scene":81,"flashback":false,"intensity":0.2718277,"content_short":"EXT. FRONT ENTRANCE - HECTOR’S VILLA - NIGHT\n -- the night rich with the whir of insects. He scans the area, gun raised.\n His eyes move to a PALM FROND, swaying in a breeze as --\n -- POOF, a bullet whistles through it into him. Guard #9 staggers and falls. As crickets chirp, his body just lies on the g"},{"SCENE_NUM":82,"scene":82,"flashback":false,"intensity":-0.000963,"content_short":"EXT. GARDENS/TRANSFORMER BOX - HECTOR’S VILLA - NIGHT\n CRUISE CUTS THE WIRE on an ancient TRANSFORMER. Nothing happens. Wrong wire. As he tries different wires in the tangled mess--"},{"SCENE_NUM":83,"scene":83,"flashback":false,"intensity":0.25452876,"content_short":"INT. GROUND FLOOR HALLWAY - HECTOR’S VILLA - NIGHT\n The Mother is exposed as she moves through the villa. A GUARD #10 spots her and pursues. She ducks into a room and closes the door--\n Then FIRES THROUGH THE CLOSED DOOR--\n Killing Guard #10. She slips out of the door, past his body and into the hallwa"},{"SCENE_NUM":84,"scene":84,"flashback":false,"intensity":0.2342986,"content_short":"EXT. INTERNAL COURTYARD - HECTOR’S VILLA - NIGHT\n The Mother cuts across an internal courtyard and up the exterior stairs, KILLING ANOTHER GUARD #11 and slipping into--"},{"SCENE_NUM":85,"scene":85,"flashback":false,"intensity":-0.000963,"content_short":"INT. EAST CORRIDOR/HECTOR’S VILLA - CONTINUOUS\n The east corridor--\n Where a GUARD #12 SMOKES ON A BALCONY. The Mother approaches stealthily, killing him casually, then -"},{"SCENE_NUM":86,"scene":86,"flashback":false,"intensity":-0.000963,"content_short":"EXT. HECTOR’S VILLA GROUNDS - CONTINUOUS\n Cruise finally cuts the right wire. As it sparkles like a firecracker, he pivots to watch the lights go out on the mansion."},{"SCENE_NUM":87,"scene":87,"flashback":false,"intensity":0.79628676,"content_short":"INT. EMPTY ROOM - EAST WING - HECTOR’S VILLA - NIGHT\n The Mother pulls out a FLASHLIGHT as she slips into the room. The flashlight reveals a mess of wrappers and snacks. A mattress on the floor.\n Every instinct heightened, the Mother sweeps the beam of light toward a pile of bedding in the corner. It’"},{"SCENE_NUM":88,"scene":88,"flashback":false,"intensity":0.28480947,"content_short":"INT. EAST CORRIDOR - HECTOR’S VILLA - CONTINUOUS\n I got her, we’re on our way.\n Gun in one hand, Zoe’s arm in the other, the Mother steers the girl roughly ahead.\n Jesus, my arm.\n Stay right here, stay right on my side with me.\n I can’t see...\n Shhh. Heading to you, ten seconds... five....\n As she guides Z"},{"SCENE_NUM":89,"scene":89,"flashback":false,"intensity":0.2304215,"content_short":"INT./EXT. FRONT ENTRANCE - HECTOR’S VILLA - MOMENTS LATER\n The Mother reaches her rendezvous with Cruise. Zoe sees Cruise’s familiar face and THROWS HER ARMS AROUND HIM. He instinctively lifts her to carry her out.\n It’s okay now. Let’s go.\n The Mother hesitates.\n I need ten minutes."},{"SCENE_NUM":90,"scene":90,"flashback":false,"intensity":0.85776365,"content_short":"INT. HECTOR’S BEDROOM - HECTOR’S VILLA - NIGHT\n The Mother eases open the door with her gun. The bodies of GUARDS #6 + #7 are visible on the bedroom terrace beyond. She steps into the room.\n Flickering candles from a vast altar cast wavering shadows across the walls. A portable record player plays -\n T"},{"SCENE_NUM":91,"scene":91,"flashback":false,"intensity":-0.0012363,"content_short":"INT. BOARDING AREA - JOSE MARTI AIRPORT - DAY\n Zoe, Cruise and the Mother sitting in a row on hard seats, as a steady flow of Spanish announcements fill the air around them. Zoe is head down over her phone. The Mother and Cruise feign normalcy. Just another family traveling home after a vacation."},{"SCENE_NUM":92,"scene":92,"flashback":false,"intensity":-0.000963,"content_short":"INT. RENTAL CAR COMPANY - USA - DAY\n Cruise is at the counter renting a car. Ragged from a day of travel, Zoe now sits on the floor by the wall, her phone plugged into the wall socket. The Mother stands a few feet away, watching Zoe’s total absorption in her phone."},{"SCENE_NUM":93,"scene":93,"flashback":false,"intensity":0.60057604,"content_short":"INT. JEEP GRAND CHEROKEE - MIDWESTERN HIGHWAY - NIGHT\n Cruise now drives. The Mother rides shotgun. Zoe's in the back, her fingers flying over the phone keys. We see her Google search. Adoption. Birth Mother. Finding birth parents without information?\n The Mother’s eyes go to her daughter's reflection"},{"SCENE_NUM":94,"scene":94,"flashback":false,"intensity":0.16401745,"content_short":"INT. TRUCK STOP - NIGHT\n As The Mother enters past the RINGING DOOR, she glances back outside. While the car fills up, Cruise and Zoe are playing the “hand slap” game on the oily pavement.\n The Mother watches, curious at how Cruise can connect with her so easily.\n She moves down an aisle and stops sudd"},{"SCENE_NUM":95,"scene":95,"flashback":false,"intensity":0.7356385,"content_short":"EXT. TRUCK STOP - NIGHT\n Carrying a bag, The Mother emerges to see Zoe by the car, watching her with the same maddening intensity.\n The Mother digs in the bag, but only throws her the PACK OF GUM. Zoe’s surprised but snatches it out of the air.\n Thanks.\n Thank the FBI. Cruise got it for you.\n The Mother"},{"SCENE_NUM":96,"scene":96,"flashback":false,"intensity":0.36511046,"content_short":"INT. JEEP GRAND CHEROKEE - CONTINUOUS\n For the first time we shift POV to Zoe, watching this woman walk away under gas station lights. Cruise slides behind the wheel.\n We got about six more hours, so if you want to nap, be my guest...\n Why won’t she just admit it?\n What’s that?\n That she’s my mother.\n Cru"},{"SCENE_NUM":97,"scene":97,"flashback":false,"intensity":0.7333274,"content_short":"EXT. TRUCK STOP AND BIKER BAR - NIGHT\n THE MOTHER. Determined, she keeps walking as the car drives past, her face glowing red in its taillights.\n She keeps walking, seeing Zoe turn to look at her in the back window.\n They are almost gone, shrinking away. Then Zoe reaches out and waves, just a shadow in"},{"SCENE_NUM":98,"scene":98,"flashback":true,"intensity":0.33213156,"content_short":"EXT. ADRIAN’S VILLA - DAY - 2007 - FLASHBACK\n The Mother and Hector are shown in by a VALET (male, early 50’s). The villa is minimal, elegant, sophisticated, and the Mother has dressed accordingly. She looks around as Adrian steps into view. They take each other in.\n Nice. Yours?\n A loan from a friend."},{"SCENE_NUM":99,"scene":99,"flashback":false,"intensity":0.8569745,"content_short":"INT. BEDROOM - HECTOR’S APARTMENT - LATE AFTERNOON\n In Hector’s stylish apartment, the Mother is in a short robe, carefully putting on her MAKE-UP.\n I hate this bullshit.\n In the mirror, she watches Hector pace and fret over his suit and tie. He finishes a half-windsor knot, then pulls it apart again,"},{"SCENE_NUM":100,"scene":100,"flashback":false,"intensity":-0.000963,"content_short":"INT. PRIVATE CLUB - HAVANA - DUSK\n FROM BEHIND -- arm in arm, Hector and The Mother ascend a staircase. He wears his suit; but we see only her BARE BACK in a backless, floor length dress.\n She seems not so much to hang on Hector’s arm -- but to guide him.\n Be cool."},{"SCENE_NUM":101,"scene":101,"flashback":false,"intensity":0.28863573,"content_short":"INT. PRIVATE CLUB - UPSTAIRS - HAVANA - DUSK\n As light fades outside, this exclusive room is a sanctuary of expats and Cuba’s rich exporters, a callback to the bygone lavish days of Batista. The place is mostly men, chewing their cigars; but the few women stand out like painted peacocks -- too young,"},{"SCENE_NUM":102,"scene":102,"flashback":false,"intensity":0.15287599,"content_short":"EXT. STREET BELOW PRIVATE CLUB - NIGHT\n As the light fades, it’s a glowing festive square amid the dark buildings and deepening night. As The Mother and Adrian approach the dancers, suddenly the music slows to something carnal and intimate.\n Adrian places his HAND ON HER BACK.\n He pulls her closer. The"},{"SCENE_NUM":103,"scene":103,"flashback":false,"intensity":0.4043308,"content_short":"INT. PRIVATE CLUB - HAVANA - NIGHT\n CHAMPAGNE IN ICE and an elaborate box of Cuban cigars.\n Brought to the table where THE MOTHER, ADRIAN, HECTOR, and TWO OF HECTOR’S LIEUTENANTS now sit.\n Everyone looks flushed and alive and happy, except Hector, who’s seething with hatred for his new client.\n ADRIAN h"},{"SCENE_NUM":104,"scene":104,"flashback":false,"intensity":-0.000963,"content_short":"EXT. BIKER BAR - NIGHT - THE PRESENT\n -- THE CRACKLING OF FIRECRACKERS. The Mother watches BIKERS setting off POPPERS and ROMAN CANDLES outside the BAR.\n Her eyes follow them as they go inside, then back to the ROW OF THEIR MOTORCYCLES. A thought forms in her eyes."},{"SCENE_NUM":105,"scene":105,"flashback":false,"intensity":0.33974212,"content_short":"INT. JEEP GRAND CHEROKEE - SUNRISE\n As CRUISE drives, passing a sign -- “Cincinnati: 39 miles” -- he notices Zoe stirring in the backseat. She wakes, looking sleepily around.\n Want to hear something nice?\n ‘Kay.\n Not too far now. You’ll sleep in your own bed tonight, how about tha--\n -- SLAAAAMM! THEY’RE"},{"SCENE_NUM":106,"scene":106,"flashback":false,"intensity":-0.000963,"content_short":"EXT. HIGHWAY - SUNRISE\n A speeding motorcycle eats up the highway. In the distance, the WRECKED JEEP CHEROKEE and Zoe’s tiny figure paralyzed between two unfamiliar SUV’s.\n The sound of The Mother’s panicked breath as she revs the motorcycle even faster."},{"SCENE_NUM":107,"scene":107,"flashback":false,"intensity":0.7142141,"content_short":"EXT. HIGHWAY - SUNRISE\n The motorcycle pulls up to the wreckage of shattered glass and twisted steel. The Cherokee is leaking gasoline from a broken fuel line. The Mother leaps off the bike, her only thought --\n Zoe!\n Pulling off her helmet as she rounds the vehicle, the MOTHER aims her PISTOL and sees"},{"SCENE_NUM":108,"scene":108,"flashback":false,"intensity":0.4457345,"content_short":"EXT. TRENCH BESIDE THE HIGHWAY - SUNRISE\n ON ZOE -- \n Backlit, only a thin shadow, Zoe scrambles and slips down into a drainage ditch.\n The explosion on the road above casts bright orange light over her tiny figure, traumatized, as she stumbles and falls, the firelight above her as she runs into a fiel"},{"SCENE_NUM":109,"scene":109,"flashback":false,"intensity":-0.000963,"content_short":"EXT. HIGHWAY/FARMLAND - SUNRISE\n Adrian watches the incoming vehicles as he assesses the situation. Cruise’s body lies beside two of the deceased Henchmen. The rental vehicle BURNS in the first rays of dawn.\n Adrian and his two remaining Henchmen climb into their vehicles to escape. But Adrian pauses"},{"SCENE_NUM":110,"scene":110,"flashback":false,"intensity":0.89433116,"content_short":"INT. DINER - NORTH DAKOTA - DAY\n Exhausted, The Mother and Zoe sit across from each other in a booth. Zoe swims in discomfort at the silence, shocked by Cruise’s death, focused on only one thing.\n When am I going home?\n You can’t.\n Zoe looks at her with horror, trying to hold back tears.\n You want to cry"},{"SCENE_NUM":111,"scene":111,"flashback":false,"intensity":0.914455,"content_short":"EXT. DINER - NORTH DAKOTA - MOMENTS LATER\n The Mother leaves the diner, phone to her ear.\n She tosses Zoe’s phone in the trash as an overwhelmed voice answers.\n Hello...?\n I’m calling to tell you she’s safe.\n An EXHALE on the line brings us to SONYA’S SIDE OF THE CALL --\n Let me talk to her?\n -- where FBI"},{"SCENE_NUM":112,"scene":112,"flashback":false,"intensity":0.52036476,"content_short":"EXT. AL-CAN HIGHWAY - DAY\n The Pickup heads down a long, straight road. In the distance, a magnificent mountain range. The Mother sighs.\n It’s been a long journey.\n There it is. That’s where we’re going.\n Zoe couldn’t care less. Her body is turned away from the Mother’s, tight with rage and resentment."},{"SCENE_NUM":113,"scene":113,"flashback":false,"intensity":0.22598055,"content_short":"INT. MARKET - AT THE DOCK - DAY\n Starving, Zoe snags items off shelves, piling a cart full of junk food. She can’t wait any longer and tears open Skittles, sneaking a few.\n Down the aisle, The Mother talks in a hushed tone to Jons. Zoe watches. They don’t seem to know each other...\n That’s a nice-looki"},{"SCENE_NUM":114,"scene":114,"flashback":false,"intensity":0.30515435,"content_short":"INT. PICK-UP TRUCK - MARKET - MOMENTS LATER\n As the truck leaves the market, Zoe devours a packet of Ritz crackers.\n So you knew that guy, right?\n What?\n Why do you pretend you don’t know each other?\n We don’t.\n Strangers don’t talk like that, it was like... spies or something. Talking in code.\n The Mother"},{"SCENE_NUM":115,"scene":115,"flashback":false,"intensity":-0.000963,"content_short":"EXT. ALASKA - DAY\n TRACKING through trees, we reveal the cabin."},{"SCENE_NUM":116,"scene":116,"flashback":false,"intensity":0.22038266,"content_short":"INT. ALASKAN CABIN - MOMENTS LATER\n Zoe stares at the one-room dwelling, shocked by the fur blankets, the hides on the floor, the bare necessities.\n The Mother tosses her a jacket.\n Come on. Gotta eat."},{"SCENE_NUM":117,"scene":117,"flashback":false,"intensity":0.38446355,"content_short":"EXT. ALASKAN FOREST - LATE AFTERNOON\n Zoe struggles to keep up, the hand-me-down jacket rolled up to fit her. Ahead of her, the Mother carries a HUNTING RIFLE.\n The MOTHER pauses. She gestures for Zoe to be quiet, then points ahead at --\n -- A MASSIVE STAG, walking slowly through the undergrowth.\n It’s"},{"SCENE_NUM":118,"scene":118,"flashback":false,"intensity":0.22508633,"content_short":"INT. ALASKAN CABIN - NIGHT\n Candles burn in bottles around them as The Mother and Zoe sit across from each other at a plain wooden table. The Mother serves two bowls of stew.\n Eat.\n I can’t.\n Yes, you can.\n I’m not eating Bambi’s Mom.\n It’s not venison. The deer has to hang, to tenderize the meat. Besides"},{"SCENE_NUM":119,"scene":119,"flashback":false,"intensity":0.78313464,"content_short":"INT./EXT. ALASKAN CABIN - NIGHT\n Inside, Zoe cries in her bed, her shoulders heaving.\n The Mother sits outside, rolling a cigarette, trying not to hear the sounds of Zoe crying. Her eyes are wide and charged, moving side to side, scanning for danger she can’t find."},{"SCENE_NUM":120,"scene":120,"flashback":false,"intensity":0.22675127,"content_short":"INT. ALASKAN CABIN - DAWN\n Zoe startles awake with The Mother standing over her.\n Meet me outside in five minutes."},{"SCENE_NUM":121,"scene":121,"flashback":false,"intensity":0.32016373,"content_short":"EXT. ALASKAN CABIN - DAWN\n The Mother has car keys in hand. They move toward the truck. She hands the keys to Zoe.\n You’re driving.\n I’m twelve.\n So? I’m going to teach you.\n Zoe pauses, suspicious.\n Why?\n You want to go home? I want that, too. But not until you know how to survive, everything it takes. Th"},{"SCENE_NUM":122,"scene":122,"flashback":false,"intensity":0.16610038,"content_short":"INT./EXT. PICK UP TRUCK - ALASKAN CABIN - DAY\n CLOSE ON THE GEAR SHIFT. It’s a MANUAL. Zoe tries to shift. She lets out the clutch. The truck sputters and lurches. Zoe yelps in fright, then focuses. Turns the key and tries again."},{"SCENE_NUM":123,"scene":123,"flashback":false,"intensity":0.00296354,"content_short":"EXT. ALASKAN FOREST - DAY\n The Mother and Zoe run full speed across the snow, toting rifles on straps."},{"SCENE_NUM":124,"scene":124,"flashback":false,"intensity":0.6315164,"content_short":"EXT. SNIPER'S FOREST - DAY\n They reach a spot and Zoe drops in the snow on her stomach, exhausted and heaving. The Mother drops onto her chest beside her, rifle ready.\n Don’t make a snow angel, get your rifle up.\n A beat.\n You don’t get to catch your breath. We do all this so you can learn to think when"},{"SCENE_NUM":125,"scene":125,"flashback":true,"intensity":0.35675836,"content_short":"INT. OB/GYN - HAVANA, CUBA - 12 YEARS AGO - FLASHBACK\n THE CUBAN DOCTOR smiles at The Mother as she looks at the grainy ULTRASOUND IMAGE in front of her. He points to the image, clarifying it for her. In Spanish, with subtitles:\n There’s the head. That’s the heart. And there... do you want to know if"},{"SCENE_NUM":126,"scene":126,"flashback":false,"intensity":0.22469376,"content_short":"INT. ADRIAN’S VILLA - NIGHT\n THE MOTHER steps into a lavish party, no expense spared.\n Men in flashy suits and women in skin-baring outfits. All of it looks very glamorous... until it isn’t."},{"SCENE_NUM":127,"scene":127,"flashback":false,"intensity":0.16926283,"content_short":"EXT. ADRIAN’S VILLA - CONTINUOUS\n The Mother moves through the party. Sees guns in waistbands, very young girls made up like women... A couple of young girls in the pool... and two GANGSTERS watching them through a viewing window below.\n ...SPIDER TATTOOS on hands and shoulders.\n She passes by a group"},{"SCENE_NUM":128,"scene":128,"flashback":false,"intensity":0.28668207,"content_short":"EXT. LOUNGE ZONE - ADRIAN’S VILLA - NIGHT\n Full of joy and bravado, Hector grabs more drinks from a WAITRESS. The Mother slides up to him, eyeing his profile.\n He doesn’t see her right away.\n When he finally notices her, his face drops. The look of shame tells her everything. He’s like a child, unable"},{"SCENE_NUM":129,"scene":129,"flashback":false,"intensity":0.39575112,"content_short":"INT./EXT. SNIPER’S FOREST - THE PRESENT\n The shot echoing off, Zoe focuses ahead into the distance.\n My turn.\n The Mother's eye moves to the sniper scope. Zoe lies beside her, eyes to binoculars, an eager observer.\n Six o’clock.\n BANG! The CD shatters into a thousand kalaidoscopic pieces.\n A breeze causes"},{"SCENE_NUM":130,"scene":130,"flashback":false,"intensity":-0.000963,"content_short":"EXT. ALASKAN FOREST - DAY\n FROM ABOVE, ZOE follows THE MOTHER along the deep braille of their snowshoe tracks. They follow the same path back, stepping in previous footsteps.\n Finally, Zoe breaks off, into the deeper woods.\n The Mother turns, watches Zoe slip away, letting her go."},{"SCENE_NUM":131,"scene":131,"flashback":false,"intensity":-0.000963,"content_short":"EXT. ALASKAN FOREST - DAY\n The Mother moves silently along the dry bed of a stream."},{"SCENE_NUM":132,"scene":132,"flashback":false,"intensity":0.75851244,"content_short":"EXT. WOLF DEN - ALASKAN FOREST - LATE AFTERNOON\n Zoe crouches near the RIVER'S EDGE, fascinated by something.\n She reaches her hand out, cautiously.\n They’re not pets.\n Zoe jumps back, startled by The Mother's sudden arrival.\n REVEAL -- A new set of WOLF CUBS, three-months old.\n Nothing out here is.\n Zoe i"},{"SCENE_NUM":133,"scene":133,"flashback":false,"intensity":0.86953324,"content_short":"INT./EXT. ALASKAN CABIN - LATE AFTERNOON\n Zoe pulls open a drawer, locating a tobacco pouch, papers, a lighter.\n She thinks for a moment, looking out the window, then --\n Sitting on the porch, mimicking the Mother, Zoe lays tobacco along the seam of a rolling paper. Feeling the adrenaline, she seals th"},{"SCENE_NUM":134,"scene":134,"flashback":true,"intensity":0.5836467,"content_short":"EXT. HAVANA PORT - NIGHT - 12 YEARS AGO - FLASHBACK\n -- A MAZE OF CARGO CONTAINERS on a busy dock as a cargo ship is being loaded with beeping forklifts and cranes.\n The Mother moves between CONTAINERS ready for shipping, the loading underway.\n Spurred by some horrible, gnawing suspicion, she moves dow"},{"SCENE_NUM":135,"scene":135,"flashback":false,"intensity":-0.000963,"content_short":"EXT. HAVANA PORT - NIGHT\n As POLICE CARS speed onto the port, and surround the CONTAINERS --"},{"SCENE_NUM":136,"scene":136,"flashback":false,"intensity":0.2923911,"content_short":"EXT. PORTA CABIN - HAVANA PORT - NIGHT\n Passing the Mother, who watches the flashers surround the illicit load on the dock, dread on her face, a cell phone to her ear.\n This is the FBI tip line.\n Hello. I am the girlfriend of Hector Álvarez, and a close friend of Adrian Lovell. I’d like to arrange a ti"},{"SCENE_NUM":137,"scene":137,"flashback":false,"intensity":0.64574504,"content_short":"INT. ALASKAN CABIN - LATE AFTERNOON - THE PRESENT\n The Mother snaps back from her memory to see Zoe turn away from her, disappointed, unheard, unseen.\n I’m here, okay? Whatever the question, that’s your answer. It’s the only answer I’ve got."},{"SCENE_NUM":138,"scene":138,"flashback":false,"intensity":0.53115666,"content_short":"EXT./INT. ALASKAN CABIN - MORNING\n Zoe sits on the porch with a bowl of oatmeal as the Mother pulls up and exits the truck with a bag full of TIN LUNCHBOXES and a THIN BOX which she hands to Zoe without ceremony. Zoe hesitates. Is this a present?\n Open it.\n Zoe slides the lid off and marvels at what's"},{"SCENE_NUM":139,"scene":139,"flashback":false,"intensity":0.26086205,"content_short":"INT./EXT. SNIPER'S NEST - ALASKAN FOREST - DAY\n 6 CD TARGETS. Tacked to trees at varying distances, diminishing in size, sending kaleidoscopic rainbows dancing through the forest. BANG!\n THROUGH THE BINOCULARS: TARGET 8. The Mother missed it before. The bullet slices through it.\n 9 O’clock.\n TARGET 9. F"},{"SCENE_NUM":140,"scene":140,"flashback":false,"intensity":0.26223966,"content_short":"INT. ALASKAN CABIN - DAY\n The Mother is surrounded by OLD RADIOS, disassembled and scattered. She rips more components from them.\n Across the table, Zoe paints the METAL LUNCH BOXES, primary colors disappearing under matte white. They work in familial silence.\n Do you miss William? Agent Cruise?\n A flas"},{"SCENE_NUM":141,"scene":141,"flashback":false,"intensity":0.60083455,"content_short":"EXT. NEAR WOLF DEN - ALASKAN FOREST - DAY\n Zoe has the Shotgun strapped to her back. She covers her tracks with deliberate steps, double-timing to keep up with The Mother.\n She carries two of the matte WHITE LUNCHBOXES. The Mother carries a PICK AXE. Sweat beads their brows. Whatever they're up to, it"},{"SCENE_NUM":142,"scene":142,"flashback":false,"intensity":0.5865995,"content_short":"INT. ALASKAN CABIN - NIGHT\n Zoe sleeps soundly. The Mother watches her, frightened by the feelings that have grown in her. She’s feeling a tug now: the girl will be going soon.\n She heads to the refrigerator, opening the ice box, the light shining across her silhouette."},{"SCENE_NUM":143,"scene":143,"flashback":false,"intensity":0.59814554,"content_short":"EXT. WOLF DEN - ALASKAN FOREST - NIGHT\n A silvery light bathes the pines as The Mother comes to the clearing near the den.\n Slowly, the MOTHER lays down DEER MEAT onto the hardpack snow at the MOUTH OF THE DEN.\n She looks inside and sees the WOLF MOTHER’S GLOWING EYES.\n The animal is severely wounded an"},{"SCENE_NUM":144,"scene":144,"flashback":false,"intensity":0.16546881,"content_short":"INT. ALASKAN CABIN - MORNING\n The Mother has overslept now. In bright light, she wakes and stretches. Right away, the ABSENCE hits her.\n Zoe’s not in bed. Not at the table. Not out by the shower. The Mother is up in an instant --"},{"SCENE_NUM":145,"scene":145,"flashback":false,"intensity":0.43458253,"content_short":"EXT. REAR CABIN - ALASKAN FOREST - DAY\n The Mother moves, 9MM in hand, dread growing with each step. Her eyes desperately search... search...\n But Zoe's a quick study. She's covered her tracks well.\n A NOISE dances through the trees. The Mother turns on a dime. Follows it. Faster. And FASTER --"},{"SCENE_NUM":146,"scene":146,"flashback":false,"intensity":0.6883465,"content_short":"EXT. ALASKAN FOREST - DAY\n The Mother spots Zoe through the trees, goes weak with RELIEF. She slows. Stays quiet. Slips back into the distance with ease as she spies...\n Zoe with the young wolves, now adolescent, big enough to look almost threatening. Zoe is feeding them MORE DEER MEAT. She smiles, th"},{"SCENE_NUM":147,"scene":147,"flashback":false,"intensity":0.48193115,"content_short":"INT. MEDICAL CLINIC - DAY\n A NURSE quickly walks with Zoe and The Mother.\n Let’s get you stitched up. We’ll get started on her. You’re her mother? There’s paperwork at the counter.\n The Mother turns to the counter. She can’t look Zoe in the eye."},{"SCENE_NUM":148,"scene":148,"flashback":false,"intensity":0.5925431,"content_short":"INT. EXAM ROOM - MEDICAL CLINIC - LATER\n The Mother enters. Zoe’s hand is wrapped in gauze. A DOCTOR is at a computer.\n Not too bad. Only took eight stitches. I’m going to send the nurse in with after-care instructions. Zoe’s a brave girl.\n The Mother blinks. What? He knows Zoe’s name. Her stress visib"},{"SCENE_NUM":149,"scene":149,"flashback":false,"intensity":0.24953118,"content_short":"EXT. MEDICAL CLINIC - DAY\n Zoe is distraught as she follows the Mother to the pickup.\n I didn’t know. I didn’t know I shouldn’t give them my real name.\n It’s my fault. I should’ve told you.\n Are they coming?\n Maybe.\n Soon?\n The Mother nods. They both climb in.\n I’m sorry.\n From here on, do everything I say."},{"SCENE_NUM":150,"scene":150,"flashback":false,"intensity":0.16677976,"content_short":"INT. MARKET - AT THE DOCK - DAY\n Zoe is just outside the store. Throwing rocks in the water. And trying to eavesdrop on the conversation.\n She gave her real name. They put it in the computer. I can’t risk it.\n The Mother hands Jons a LETTER.\n Give her this once it’s all over.\n She then hands him a duffle"},{"SCENE_NUM":151,"scene":151,"flashback":false,"intensity":0.87751454,"content_short":"EXT. MARKET - AT THE DOCK - DAY\n She walks right past Zoe.\n I hate you.\n Zoe fights angry tears... The Mother doesn’t look at her.\n She just gets into her truck and drives away."},{"SCENE_NUM":152,"scene":152,"flashback":false,"intensity":0.8312183,"content_short":"INT. ALASKAN CABIN - NIGHT\n The Mother sits alone. She taps her collarbone as she dials on a SAT phone. It RINGS. Once.\n Hello...?\n A weak voice, exhausted.\n She’s still safe.\n I wish I could believe you.\n I gave you my word, you still have it.\n No one can live like this.\n You can.\n I miss her so much, I can"},{"SCENE_NUM":153,"scene":153,"flashback":false,"intensity":-0.000963,"content_short":"EXT. ALASKAN CABIN - DAWN\n The sun is low. The light pale."},{"SCENE_NUM":154,"scene":154,"flashback":false,"intensity":-0.000963,"content_short":"EXT. FERRY - ALASKAN DOCKS - EARLY MORNING\n The lonely Alaskan bay. ADRIAN and a CREW OF SIX MERCENARIES drive off the FERRY in MILITARY TRUCKS, each hauling a COUPLE OF SNOWMOBILES in back as --"},{"SCENE_NUM":155,"scene":155,"flashback":false,"intensity":-0.000963,"content_short":"INT. MARKET - AT THE DOCK - EARLY MORNING\n -- Jons spies on this team of conspicuous arrivals through the blinds over his window, phone to his ear."},{"SCENE_NUM":156,"scene":156,"flashback":false,"intensity":0.16841878,"content_short":"INT. ALASKAN CABIN - EARLY MORNING\n The Mother paces with Jons on the sat phone.\n It’s a full platoon.\n Zoe won’t be safe until they’re all gone.\n Cut off the head and the snake dies.\n Do you see him?\n Nnnn... not sure. I'll take Zoe and go.\n Tell her I’m sorry I lied about you and me.\n About what?\n She’ll k"},{"SCENE_NUM":157,"scene":157,"flashback":false,"intensity":0.25450855,"content_short":"INT. MARKET - AT THE DOCK - EARLY MORNING\n The line goes dead. Jons turns to Zoe in the doorway.\n Where are we going?\n We’re taking a trip back to the lower forty-eight.\n Don’t talk in code to me, too.\n Fair enough. I don’t know. That’s the truth. We run until we get the word.\n Zoe nods. Finally the truth"},{"SCENE_NUM":158,"scene":158,"flashback":false,"intensity":-0.000963,"content_short":"EXT. ALASKAN MOUNTAIN - MORNING\n SIX SNOWMOBILES cut their way over a ridge. A vast mountain range spreads out in front of them."},{"SCENE_NUM":159,"scene":159,"flashback":false,"intensity":0.40012652,"content_short":"EXT. LAKE’S EDGE - ALASKAN FOREST - MORNING\n Dressed in white camouflage, ADRIAN waits beside his team of MERCENARIES on SNOWMOBILES concealed by trees at the lake’s edge.\n He indicates THE CABIN across the frozen lake.\n If you cast a shadow on that ice, she’ll hit it.\n They look at him, skeptical.\n This"},{"SCENE_NUM":160,"scene":160,"flashback":false,"intensity":0.6336192,"content_short":"INT. BEDROOM - APARTMENT ABOVE MARKET - MORNING\n Zoe's not in bed. Not sleeping. How could she be?\n She quietly searches the room. Every drawer in the desk.\n Under the bed. The dresser. Until she finds...\n The LETTER. The one she saw The Mother give Jons. She tears it open. Eyes hopscotching over the wo"},{"SCENE_NUM":161,"scene":161,"flashback":false,"intensity":0.3964293,"content_short":"INT. ALASKAN CABIN - MORNING\n The Mother prepares for war. Slips into STEALTH BLACK THERMALS...\n “You have been surrounded by love. I made sure of it. And because of William, because your parents, you are a marvel...”\n Black pants. Jacket. She slings the Shotgun over her shoulder...\n “Every birth is a v"},{"SCENE_NUM":162,"scene":162,"flashback":false,"intensity":-0.000963,"content_short":"EXT. SNIPERS NEST - MORNING\n The Mother pulls a long black bag by a rope, high up into the Snipers Nest. She unzips the bag and stashes the rifle and the shotgun in the box, partially covering them with a green blanket."},{"SCENE_NUM":163,"scene":163,"flashback":false,"intensity":0.63437444,"content_short":"INT. BEDROOM - APARTMENT ABOVE MARKET - MORNING\n Zoe's breath is caught in her throat as she reads --\n “I have shown you my love in the only way I know how. If the time comes when you need to use what I've taught you, don’t hesitate to take your place in this world. Love always, Your Mother.”\n That las"},{"SCENE_NUM":164,"scene":164,"flashback":false,"intensity":0.23759153,"content_short":"EXT. LAKE’S EDGE - ALASKAN FOREST - MORNING\n Calm before the storm type quiet. ADRIAN stands at the lake’s edge, binoculars trained at the cabin. The RADIO in his ear CRACKLES.\n I've circled behind --\n KA-BOOOOOOOOOOOOOOOOOOM! ADRIAN's eyes snap to the sound.\n An explosion sends smoke and flames up thro"},{"SCENE_NUM":165,"scene":165,"flashback":false,"intensity":0.33004922,"content_short":"EXT. NEAR THE CABIN - ALASKAN FOREST - MORNING\n MERCENARY #2 climbs off his snowmobile, eyes to the ground, checking for mines, too preoccupied to notice... The Mother slipping out of the tree cover behind him. He moves slowly, inch by inch, never taking his eyes off the snow at his feet.\n She moves j"},{"SCENE_NUM":166,"scene":166,"flashback":false,"intensity":0.16906561,"content_short":"INT. BEDROOM - APARTMENT ABOVE MARKET - DAY\n Jons peeks through the cracked door.\n Zoe?\n The sound of a truck ignition outside is his only answer."},{"SCENE_NUM":167,"scene":167,"flashback":false,"intensity":-0.000653,"content_short":"EXT. PARKING LOT - MARKET - DAY\n Jons rushes out as fast as his limp will allow. His truck is already speeding away..."},{"SCENE_NUM":168,"scene":168,"flashback":false,"intensity":0.27158964,"content_short":"EXT. ALASKAN CABIN - DAY\n VROOOOOM! A SNOWMOBILE shoots across the ice, driven by Mercenary #3. A LUNCHBOX MINE is strapped to the front.\n It aims straight for the CABIN. At the very last moment, Mercenary #3 LEAPS FROM THE SNOWMOBILE.\n The SNOWMOBILE keeps going, hitting a FALLEN TREE and FLIPPING.\n CL"},{"SCENE_NUM":169,"scene":169,"flashback":false,"intensity":-0.000963,"content_short":"EXT. LAKE’S EDGE - ALASKAN FOREST - DAY\n From across the lake, Adrian watches his handiwork."},{"SCENE_NUM":170,"scene":170,"flashback":false,"intensity":0.55271906,"content_short":"EXT. NEAR THE CABIN - ALASKAN FOREST - CONTINUOUS\n The RAGING FIRE reflects in the HELMET VISOR of MERCENARY #3. He lifts it, so that orange light glows on his face.\n He speaks into the radio with a Chechen accent:\n The cabin is gone.\n Confirm she's not in there.\n A branch SNAPS behind MERCENARY #3. He s"},{"SCENE_NUM":171,"scene":171,"flashback":false,"intensity":-0.000963,"content_short":"EXT. ALASKAN FOREST - DAY\n The Mother rides the stolen snowmobile to the South Road."},{"SCENE_NUM":172,"scene":172,"flashback":false,"intensity":0.6726101,"content_short":"EXT. DISTANT ROAD - ALASKAN FOREST - DAY\n A CRASHED PICKUP --\n -- in a SNOWBANK far below.\n Mercenary #4 rips Zoe out of the car. She fights him, desperate and sloppy, scared out of her mind.\n But she's her Mother's daughter -- and she's got a magic trick.\n SHEEEEATH! Her Switchblade appears out of thin"},{"SCENE_NUM":173,"scene":173,"flashback":false,"intensity":0.20100653,"content_short":"EXT. ALASKAN FOREST - MOMENTS LATER\n Mercenary #5 pulls up alongside Mother. She shoots him, then rides along THE RIDGE ABOVE. She never takes her eyes off Zoe, who keeps fighting on the snowmobile.\n The Mother accelerates, pulling almost parallel.\n As she finally pulls ahead on the ridge, Zoe looks up"},{"SCENE_NUM":174,"scene":174,"flashback":false,"intensity":0.50932443,"content_short":"EXT. ALASKAN FOREST - DAY\n Zoe now steers as MERCENARY #6 and #7 and #8, in pursuit, FIRE AT THE SNOWMOBILE.\n Zoe swerves the snowmobile toward a HIDDEN LOG, causing MERCENARY #7 TO crash violently.\n The Mother turns back to kill MERCENARY #6.\n Steer toward the lake."},{"SCENE_NUM":175,"scene":175,"flashback":false,"intensity":0.16955313,"content_short":"EXT. FROZEN LAKE - ALASKAN FOREST - DAY\n They emerge from the treeline, and out across the ice.\n Mercenary #8 still guns for them. The Mother pulls around the STOLEN ASSAULT RIFLE strapped to her back, aiming down at the ice --\n BOOMBOOMBOOMBOOMBOOM! Shells crack up the ice in their wake. The cracks sp"},{"SCENE_NUM":176,"scene":176,"flashback":false,"intensity":0.86818427,"content_short":"EXT. SNIPER'S NEST - ALASKAN FOREST - DAY\n SNOW falls through the trees. Zoe and The Mother scramble up into the Snipers nest, where the Mother opens the box to retrieve her rifle. The stolen radio crackles from the tactical vest.\n Stay off the radios --\n They're coming.\n Zoe moves for the gun. The Moth"},{"SCENE_NUM":177,"scene":177,"flashback":false,"intensity":0.87359256,"content_short":"EXT. SIDE OF CLIFF - ALASKAN FOREST - DAY\n The Mother emerges from the tree line to a clearing near a cliff’s edge -- a 30-FOOT DROP.\n Drop your weapons over the side.\n She freezes. Carefully, she unstraps her RIFLE, takes a few more steps, and TOSSES IT OFF THE CLIFF’S EDGE. It takes two seconds befor"},{"SCENE_NUM":178,"scene":178,"flashback":false,"intensity":0.4009626,"content_short":"EXT. SNIPER'S NEST - ALASKAN FOREST - DAY\n Zoe glances to the LADDER, leading to her escape. “Run no matter what.” But she can’t. She puts her eye to the scope, fumbling with the ammo.\n THROUGH THE SCOPE: Flashes of movement through the maze of trees. Zoe sees The Mother has Adrian in neck scissors, l"},{"SCENE_NUM":179,"scene":179,"flashback":false,"intensity":0.5386983,"content_short":"EXT. SIDE OF CLIFF - ALASKAN FOREST - DAY\n Adrian BREAKS FREE from the scissor hold, flipping back, holding her down by the neck with one hand and punching at her face with the other.\n -- She evades, twisting to reach into her boot for ZOE’S SWITCHBLADE. She SLASHES across his blind side.\n BLOOD spatte"},{"SCENE_NUM":180,"scene":180,"flashback":false,"intensity":0.00909147,"content_short":"EXT. SNIPER’S NEST - ALASKAN FOREST - DAY\n From this far away we can just make out Adrian and The Mother at the cliff’s edge."},{"SCENE_NUM":181,"scene":181,"flashback":false,"intensity":0.67050785,"content_short":"EXT. SIDE OF CLIFF - ALASKAN FOREST - DAY\n Adrian’s eyes scan upward, searching for THE SNIPER'S NEST. He's not just choking The Mother, but using her as a human shield.\n I see where you’re looking. She's just up there, isn’t she?\n The Mother’s eyes look to the sniper’s nest, praying for Zoe to run.\n Sh"},{"SCENE_NUM":182,"scene":182,"flashback":false,"intensity":0.11799376,"content_short":"EXT. SNIPER’S NEST - ALASKAN FOREST - DAY\n The sniper’s nest. Empty. Zoe has left it -- and now it’s an empty perch, faintly rocking in the wind."},{"SCENE_NUM":183,"scene":183,"flashback":false,"intensity":0.23555872,"content_short":"EXT. CLIFF’S EDGE - ALASKAN FOREST - DAY\n Locked in Adrian’s arms, The Mother’s eyes still search the trees as --\n BOOOOM! A DEAFENING BLAST comes from THE ROCKS BESIDE THEM.\n The SHOT rips into The Mother’s chest with such force that it throws both of them - ADRIAN AND THE MOTHER - over the CLIFF’S ED"},{"SCENE_NUM":184,"scene":184,"flashback":false,"intensity":0.61658496,"content_short":"EXT. SLOPE OF CLIFF - ALSKAN FOREST - DAY\n They slide down the nearly-straight drop at lightning speed, tearing through ROCKS and ROOTS, caroming off each other.\n ADRIAN SMASHES into a boulder, breaking his momentum, sending him tumbling at a different angle and in a slower slide.\n Unconscious, The Mot"},{"SCENE_NUM":185,"scene":185,"flashback":false,"intensity":0.4028709,"content_short":"EXT. BOTTOM OF THE CLIFF - ALASKAN FOREST - DAY\n -- with bone-crushing impact that DISLOCATES her arm."},{"SCENE_NUM":186,"scene":186,"flashback":false,"intensity":0.5615572,"content_short":"EXT. ALASKAN FOREST - DAY\n REVERSE TO REVEAL -- ZOE. Not only did she abandon the nest to make rapid time across the forest, but she took the shot from CLOSE RANGE, hidden from view in the dense bushes.\n Her face is now flushed and terrified. Her ears are ringing from the blast, deafening her, so that"},{"SCENE_NUM":187,"scene":187,"flashback":false,"intensity":0.87013334,"content_short":"EXT. BOTTOM OF THE CLIFF - DAY\n As Zoe’s heartbeat still thumps in post-lap, The Mother's BODY lies inert.\n In pain, ADRIAN picks himself up. He stares down at The Mother’s body for a moment. Suddenly, he kicks her, hard, making sure that she’s lifeless.\n Then Adrian begins climbing uphill along outcro"},{"SCENE_NUM":188,"scene":188,"flashback":false,"intensity":0.5105878,"content_short":"EXT. ALASKAN FOREST - DAY\n With a limited view, Zoe spots The Mother below. She inches down the slope toward her.\n Come on, come on...\n She gathers speed as her line of sight improves, letting gravity take hold of her until --\n -- OOF! Adrian lunges out from behind rocks and clotheslines her. Zoe scream"},{"SCENE_NUM":189,"scene":189,"flashback":false,"intensity":0.93601793,"content_short":"EXT. BOTTOM OF THE CLIFF - DAY\n -- but it echoes off as if in a dream.\n THE MOTHER’S LIFELESS BODY lies still, sunken in the snow pack, her DISLOCATED ARM splayed at an unnatural angle.\n A tiny figure in the vast landscape.\n No sign of Zoe, or Adrian. Trees creak in the wind. The crack of ice and the hu"},{"SCENE_NUM":190,"scene":190,"flashback":false,"intensity":0.39106768,"content_short":"EXT. PLAYGROUND - DAY\n On a crowded playground on a Saturday afternoon, a tall lithe girl, fresh off a growth spurt, leaps and does a perfect “wolf jump,” landing barefoot and spinning.\n Then she vaults into the sand beside her friends and her SHOES, tying them back on.\n ZOE'S PARENTS sit across the pa"},{"SCENE_NUM":191,"scene":191,"flashback":false,"intensity":0.23369154,"content_short":"EXT. APARTMENT NEAR PLAYGROUND - DAY\n THE MOTHER. With longer hair, dressed as if for a day job. She sits at a window with only the SCOPE from a disassembled SNIPER RIFLE.\n A smile crests her lips as she watches Zoe passing a boy and not slowing down, rolling to her PARENTS and plopping onto the bench"}]